chat-app/app/auth/authenticate_user.rb

  def user
    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nolan@gmail.com"], ["LIMIT", 1]]