chat-app/app/controllers/chat_messages_controller.rb

SELECT chat_messages.id, users.name, chat_messages.content, chat_messages.created_at FROM "users" INNER JOIN "chat_messages" ON "chat_messages"."created_by" = "users"."id" ORDER BY chat_messages.id DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    @messages = User.joins(:chat_messages).select("chat_messages.id", "users.name", "chat_messages.content", "chat_messages.created_at").order("chat_messages.id").last(10)