chat-app/app/controllers/users_controller.rb

  def index
    @users = User.select("id", "name", "email", "is_online")
---
SELECT "users"."id", "users"."name", "users"."email", "users"."is_online" FROM "users"

  def create
    user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)