chat-app/app/jobs/chat_message_creation_event_broadcast_job.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def perform(chat_message)
    name = User.find(chat_message.created_by)