chat-app/app/models/user.rb

UPDATE "users" SET "is_online" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_online", 1], ["updated_at", "2020-02-10 15:50:08.846114"], ["id", 5]]
---
  def appear
    self.update(is_online: true)

UPDATE "users" SET "is_online" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_online", 0], ["updated_at", "2020-02-10 18:03:20.316016"], ["id", 5]]
---
  def disappear
    self.update(is_online: false)