chat-app/app/channels/chat_channel.rb

  def appear(data)
    @user = User.find(data["id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def create(opts)
    ChatMessage.create(
        content: opts.fetch('content'), created_by: opts.fetch('created_by')
    )
---
INSERT INTO "chat_messages" ("content", "created_at", "updated_at", "created_by") VALUES (?, ?, ?, ?)  [["content", "hey"], ["created_at", "2020-02-13 15:31:15.283237"], ["updated_at", "2020-02-13 15:31:15.283237"], ["created_by", "9"]]